---
kind: other
id: Properties.T:Autodesk.Revit.DB.IFC.IFCTransformSetter
source: html/6218d124-ed2a-b9b5-3579-c232b7daacd7.htm
---
# IFCTransformSetter Properties

Specifies whether the .NET object represents a valid Revit entity.